In [4]:
%load_ext sql

In [5]:
from urllib.parse import quote_plus

password = quote_plus("pooja2005@#E")
connection_string = f"mysql+mysqlconnector://root:{password}@localhost/sql_notebook"

%sql {connection_string}

In [9]:
%%sql
use uber;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [18]:
%%sql
drop table rides;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [23]:
%%sql
create table rides(
    ride_id int,
    driver_id int,
    rider_id int,
    pickup_location varchar(100) not null,
    dropoff_location varchar(100) not null,
    ride_date datetime not null,
    fare decimal(10,2) not null,
    primary key (ride_id, driver_id)
);

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [24]:
%%sql
desc uber.rides;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', 'PRI', None, ''),
 ('rider_id', 'int', 'YES', '', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [34]:
%%sql
insert into rides values (1, 103, 202, 'Chennai Central', 'T Nagar', '2025-08-01 10:15:00', 250.50);

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.

[]

In [35]:
%%sql
select * from uber.rides;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
3 rows affected.

[(1, 101, 201, 'Chennai Central', 'T Nagar', datetime.datetime(2025, 8, 1, 10, 15), Decimal('250.50')),
 (1, 103, 202, 'Chennai Central', 'T Nagar', datetime.datetime(2025, 8, 1, 10, 15), Decimal('250.50')),
 (2, 101, 202, 'Chennai Central', 'T Nagar', datetime.datetime(2025, 8, 1, 10, 15), Decimal('250.50'))]

In [36]:
%%sql
create table users( userid int primary key,emailid varchar(100) unique);

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [40]:
%%sql
insert into users(userid,emailid)values(2,'abc2@gmail.com');

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.

[]

In [46]:
%%sql 
select * from users;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
4 rows affected.

[(3, None),
 (1, 'abc1@gmail.com'),
 (2, 'abc2@gmail.com'),
 (4, 'abc4@gmail.com')]

In [45]:
%%sql
insert into users(userid,emailid)values(4,'abc4@gmail.com');

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.

[]

In [47]:
%%sql
drop table rides;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [48]:
%%sql
create table rides(
    rideid int primary key,
driverid int not null,riderid int not null,pickuploc varchar(100) not null,
dropoffloc varchar(100)not null,
ridedate datetime not null,
fare decimal(10,2) check(fare>0));

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [53]:
%%sql
insert into rides 
values (2, 101, 201, 'Chennai Central', 'T Nagar', '2025-08-01 10:15:00', 210.50);

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.

[]

In [54]:
%%sql
select * from rides;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
2 rows affected.

[(1, 101, 201, 'Chennai Central', 'T Nagar', datetime.datetime(2025, 8, 1, 10, 15), Decimal('250.50')),
 (2, 101, 201, 'Chennai Central', 'T Nagar', datetime.datetime(2025, 8, 1, 10, 15), Decimal('210.50'))]

In [69]:
%%sql
 drop table rides;
drop table drivers;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.
0 rows affected.

[]

In [70]:
%%sql

create table drivers(
  driverid int primary key,
  drivername varchar(100),
  licensenum varchar(50) unique);
 
 CREATE TABLE rides (
    rideid INT PRIMARY KEY,
    driverid INT,
    pickuploc VARCHAR(100),
    dropoffloc VARCHAR(100),
    ridedate DATETIME,
    fare DECIMAL(10,2),
    FOREIGN KEY (driverid) REFERENCES drivers(driverid) ON DELETE CASCADE
);

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.
0 rows affected.

[]

In [71]:
%%sql
desc drivers;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
3 rows affected.

[('driverid', 'int', 'NO', 'PRI', None, ''),
 ('drivername', 'varchar(100)', 'YES', '', None, ''),
 ('licensenum', 'varchar(50)', 'YES', 'UNI', None, '')]

In [72]:
%%sql
desc rides;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
6 rows affected.

[('rideid', 'int', 'NO', 'PRI', None, ''),
 ('driverid', 'int', 'YES', 'MUL', None, ''),
 ('pickuploc', 'varchar(100)', 'YES', '', None, ''),
 ('dropoffloc', 'varchar(100)', 'YES', '', None, ''),
 ('ridedate', 'datetime', 'YES', '', None, ''),
 ('fare', 'decimal(10,2)', 'YES', '', None, '')]

In [73]:
%%sql
INSERT INTO drivers (driverid, drivername, licensenum) 
VALUES (1, 'Ravi Kumar', 'TN-45-AB-1234'),(2, 'Anita Sharma', 'DL-09-CD-5678');

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
2 rows affected.

[]

In [74]:
%%sql
select * from drivers;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
2 rows affected.

[(1, 'Ravi Kumar', 'TN-45-AB-1234'), (2, 'Anita Sharma', 'DL-09-CD-5678')]

In [75]:
%%sql
INSERT INTO rides (rideid, driverid, pickuploc, dropoffloc, ridedate, fare)
VALUES (101, 1, 'Chennai Central', 'T Nagar', '2025-08-20 10:30:00', 250.00);

INSERT INTO rides (rideid, driverid, pickuploc, dropoffloc, ridedate, fare)
VALUES (102, 2, 'Velachery', 'Guindy', '2025-08-20 12:15:00', 180.00);

INSERT INTO rides (rideid, driverid, pickuploc, dropoffloc, ridedate, fare)
VALUES (103, 1, 'Adyar', 'Marina Beach', '2025-08-21 09:00:00', 220.00);

INSERT INTO rides (rideid, driverid, pickuploc, dropoffloc, ridedate, fare)
VALUES (104, 2, 'Anna Nagar', 'Chennai Airport', '2025-08-21 15:45:00', 450.00);

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [83]:
%%sql
select * from drivers;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.

[(2, 'Anita Sharma', 'DL-09-CD-5678')]

In [84]:
%%sql
select * from rides;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
2 rows affected.

[(102, 2, 'Velachery', 'Guindy', datetime.datetime(2025, 8, 20, 12, 15), Decimal('180.00')),
 (104, 2, 'Anna Nagar', 'Chennai Airport', datetime.datetime(2025, 8, 21, 15, 45), Decimal('450.00'))]

In [82]:
%%sql
delete from drivers where driverid=1

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.

[]